<template>
  <section class="content">
    <div class="container">
      <!--breadcrumbs-->
      <ui-breadcrumbs
        :pages="[
          { title: 'Финансовая грамотность', href: '/finansovaya-gramotnost' },
          { title: 'Общая финансовая грамотность' },
        ]"
      />
      <h1>Общая финансовая грамотность</h1>
      <!-- 👉 page-showcase -->
      <page-showcase>
        <template #title>
          Современный и удобный способ оплаты покупок
        </template>
        <template #text>
          Система быстрых платежей – это современный и удобный способ оплаты
          покупок с помощью смартфона без использования банковской карты
        </template>
        <template #img>
          <img src="/temp/icon-slim.svg" alt="" loading="lazy">
        </template>
      </page-showcase>

      <h3>Признаки финансово грамотного человека</h3>
      <div class="columns columns--cards">
        <div class="column col-6 sm-col-12">
          <div class="list-shield">
            <ul>
              <li>Готов к непредвиденным обстоятельствам</li>
              <li>Готов к непредвиденным обстоятельствам</li>
              <li>Избегает непомерных платежей и долгов по кредитам</li>
              <li>Планирует свои доходы и расходы</li>
            </ul>
          </div>
        </div>
        <div class="column col-6 sm-col-12">
          <div class="list-shield">
            <ul>
              <li>Рационально выбирает финаносовые продукты и услуги</li>
              <li>Следит за состоянием личных финансов</li>
              <li>Разбирается в финансовых вопросах</li>
            </ul>
          </div>
        </div>
      </div>

      <br>
      <br>

      <h2>Кредит</h2>
      Обратившись за ссудой в банк, человек возлагается на себя обязательства
      по ее возврату. А любые обязательства, в случае их неисполнения,
      караются санкциями. Кредитные отношения — не исключение

      <br>
      <br>
      <!-- 👉 Фрейм с роликом на ютуб -->
      <div class="video">
        <iframe
          src="https://www.youtube.com/embed/EgbpqK1XVFo?si=pI3q6UUtGgZLn17c"
          title="YouTube video player"
          frameborder="0"
          allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share"
          allowfullscreen
        />
      </div>
      <br>
      <br>

      <!-- 👉 Информационный блок с коричневым фоном -->
      <div class="information information--icon information--i">
        <b>Внимательно читайте договор</b> <br>
        Внимательно читайте договор
      </div>

      <br>
      <br>

      <!-- 👉 Информационная бизнес-карточка -->
      <business-card :reverse="true">
        <template #img>
          <img src="/temp/icon-slim.svg">
        </template>
        <template #title>
          Последствия неуплаты плачевные
        </template>
        <template #text>
          <div class="list-cancel">
            <ul>
              <li>
                Финансовая ответственность. Включает выплату неустойки, пеней
                или возврат всего займа единоразово
              </li>
              <li>
                Имущественная ответственность. Выражается в конфискации
                имущества (недвижимости, авто, банковских счетов) и их
                реализации
              </li>
              <li>
                Уголовная ответственность. Подразумевает штрафы, обязательные
              </li>
            </ul>
          </div>
        </template>
      </business-card>

      <br>
      <br>

      <h3>Кредитные каникулы</h3>
      Если в жизни возникли обстоятельства непреодолимой силы, Вы всегда
      можете взять кредитные каникулы. Порой крупные неприятности случаются в
      жизни самых добропорядочных заемщиков. Такие клиенты искренне не хотят
      лезть в долги перед банком, даже когда лишаются минимума средств, чтобы
      гасить заем. Как заложникам обстоятельств избежать наказания за
      невыплату кредита? Во-первых, стоит рассмотреть компромиссные варианты

      <br>
      <br>

      <div class="columns columns--cards">
        <div class="column col-6 sm-col-12">
          <div class="information information--grey information--back">
            <h3>Рефинансирование</h3>
            Рефинансирование — перевод текущего кредита в другой банк на более
            выгодных условиях (сниженная ставка, большой срок кредитования).
            Данная мера доступна заемщикам, еще не успевшим нарушить график
            выплат
          </div>
        </div>
        <div class="column col-6 sm-col-12">
          <div class="information information--grey information--back">
            <h3>Реструктуризация</h3>
            Реструктуризация — смягчение условий кредитования для лиц, не
            способных обслуживать долг перед банком. Включает меры по
            пролонгации займа, снижению ставки, списанию части задолженности
            (часто — штрафов, пеней и комиссий)
          </div>
        </div>
      </div>

      <br>
      <br>

      <h3>Заголовок</h3>
      Если вы предвидите серьезную нехватку капитала, лучше прибегнуть к
      рефинансированию (ссылка на наше рефинансирование): данная услуга снизит
      платежи и будет плюсом к финансовому досье. А вот реструктуризация —
      крайняя мера. Прибегнув к ней, клиент серьезно подпортит кредитную
      историю

      <br>
      <br>

      <!-- 👉 Фрейм с роликом на ютуб -->
      <div class="video">
        <iframe src="" style="background-color: #f2f2f2" />
      </div>

      <br>
      <br>

      <h2>Вклады</h2>

      <h3>Страхование вкладов</h3>
      Это система, позволяющая частным вкладчикам — физическим лицами получить
      денежные средства при отзыве лицензии или банкротстве кредитной
      организации. Для этого банки уплачивают страховые взносы за привлекаемые
      вклады в специализированный фонд, откуда производятся выплаты в случае
      дефолта. Помните крылатую фразу: «Граждане! Храните деньги в
      сберегательной кассе…»? Лучше конечно сохранить деньги и получить с них
      доход!

      <br>
      <br>

      <!-- 👉 Информационный блок с коричневым фоном -->
      <div class="information information--icon information--i">
        <b>Вклады застрахованы</b> <br>
        Помните! Все ваши вклады, размещенные в банке ЕВРОАЛЬЯНС застрахованы,
        подробнее о страховании вкладов
      </div>

      <br>
      <br>

      <!-- 👉 Фрейм с роликом на ютуб -->
      <div class="video">
        <iframe src="" style="background-color: #f2f2f2" />
      </div>

      <br>
      <br>

      <h3>Заголовок</h3>
      А также внимательно относитесь к рекламным слоганам. Гарантия
      сверхдохода не равно гарантии надежности. Внимательно читайте, что
      написано, особенно мелким шрифтом

      <br>
      <br>

      <!-- 👉 Фрейм с роликом на ютуб -->
      <div class="video">
        <iframe src="" style="background-color: #f2f2f2" />
      </div>

      <br>
      <br>

      <h3>Пенсионеры самая мнительная и не защищенная часть населения</h3>
      Они излишне доверчивы. Помогайте вашим близким и знакомым принимать
      верные финансовые решения. Предостерегите их от телефонных мошенников,
      сомнительных интернет-покупок и прочих схем вымогания денег

      <br>
      <br>

      <!-- 👉 Фрейм с роликом на ютуб -->
      <div class="video">
        <iframe src="" style="background-color: #f2f2f2" />
      </div>

      <br>
      <br>

      <h3>Навязывание страховки</h3>
      Это нарушение закона о защите прав потребителей. Запрещается
      обусловливать приобретение одних товаров (работ, услуг) обязательным
      приобретением иных товаров (работ, услуг). Убытки, причинённые
      потребителю вследствие нарушения его права на свободный выбор товаров
      (работ, услуг), возмещаются продавцом (исполнителем) в полном объёме

      <br>
      <br>

      <!-- 👉 Информационный блок с коричневым фоном -->
      <div class="information information--icon information--i">
        Согласно Указанию Банка России (№ 3854-У), заемщики могут написать
        заявление на отказ от навязанной им страховки в, так называемый, период
        охлаждения (первые <b>14 дней после подписания договора</b>)
      </div>

      <br>
      <br>

      <!-- 👉 Фрейм с роликом на ютуб -->
      <div class="video">
        <iframe src="" style="background-color: #f2f2f2" />
      </div>
    </div>
  </section>
</template>
<script lang="ts">
import BusinessCard from '~/components/cards/business-card.vue'
export default {
  components: {
    BusinessCard
  }
}
</script>
