<template>
  <section class="content">
    <div class="container">
      <!--breadcrumbs-->
      <ui-breadcrumbs
        :pages="[
          { title: 'Страхование', href: '/personal/strahovanie' },
          { title: 'Онкострахование' },
        ]"
      />
      <h1>Онкострахование</h1>
      <!-- 👉 page-showcase -->
      <page-showcase>
        <template #title>
          Онкострахование
        </template>
        <template #text>
          <div class="list-shield">
            <ul>
              <li>Постановка диагноза «инвазивный рак»</li>
              <li>
                Постановка диагноза «преинвазивный рак» (рак in situ)* —
                выявление рака на самых ранних стадиях развития болезни
              </li>
            </ul>
          </div>
        </template>
        <template #img>
          <img src="/temp/icon-slim.svg" alt="" loading="lazy">
        </template>
      </page-showcase>
      <!-- 👉 FAQ Items -->
      <div class="faq-items">
        <faq-item
          title="Какие услуги входят в программу"
          :is-active="$faq.activeIndexes[0]"
          @click="$faq.toggleActive(0)"
        >
          <div class="list-dotted">
            <ul>
              <li>
                Организация и оплата лечения: верификация диагноза, Составление
                плана лечения, диагностические исследования и анализы
              </li>
              <li>
                Лечебные медицинские вмешательства: хирургическое лечение,
                химиотерапия лучевая терапию, радиоиммунотерапия, трансплантация
                костного мозга, иные научно обоснованные и разрешенные к
                применению на территории Российской Федерации методы лечения
              </li>
              <li>
                Лечебные медицинские вмешательства: хирургическое лечение,
                химиотерапия лучевая терапию, радиоиммунотерапия, трансплантация
                костного мозга, иные научно обоснованные и разрешенные к
                применению на территории Российской Федерации методы лечения
              </li>
              <li>Лекарства, применяемые для лечения в стационаре</li>
              <li>
                Второе медицинское мнение — дистанционное экспертное заключение
                врача
              </li>
              <li>Психологическая поддержка — консультации онкопсихолога</li>
              <li>Денежная выплата при диагностировании инвазивного рака</li>
              <li>
                Онкочекап — комплекс лабораторных исследований, позволяющих
                выявить отклонения в организме даже на ранних стадиях
              </li>
              <li>
                Медицинский навигатор — маршрутизация Застрахованного лица для
                обеспечения ему максимального доступа к необходимым медицинским
                технологиям с учетом всех допускаемых законодательством Российской
                Федерации источников покрытия расходов на специализированную
                медицинскую помощь, информационно-консультационное содействие
                организации оказания медицинской помощи в соответствии с
                предоставленным планом лечения и наблюдения
              </li>
            </ul>
          </div>
        </faq-item>
      </div>

      <br>
      <br>

      <div class="table">
        <table>
          <thead>
            <tr>
              <th>
                <p style="text-align: left">
                  Заголовок
                </p>
              </th>
              <th>Базовый</th>
              <th>Премиум</th>
            </tr>
          </thead>
          <tbody class="table-body">
            <tr>
              <td>Организация и оплата лечения</td>
              <td style="text-align: center">
                5 000 000 ₽
              </td>
              <td style="text-align: center">
                12 000 000 ₽
              </td>
            </tr>
            <tr>
              <td>Персональный врач-куратор</td>
              <td><div class="check" /></td>
              <td><div class="check" /></td>
            </tr>
            <tr>
              <td>Психологическая поддержка</td>
              <td><div class="check" /></td>
              <td><div class="check" /></td>
            </tr>
            <tr>
              <td>Медицинский навигатор</td>
              <td><div class="check" /></td>
              <td><div class="check" /></td>
            </tr>
            <tr>
              <td>Второе медицинское мнение</td>
              <td><div class="check" /></td>
              <td><div class="check" /></td>
            </tr>
            <tr>
              <td>Онкочекап</td>
              <td style="text-align: center">
                Обычное лабораторное исследование
              </td>
              <td style="text-align: center">
                Расширенное лабораторное исследование
              </td>
            </tr>
            <tr>
              <td>Денежная выплата</td>
              <td><div class="check" /></td>
              <td><div class="check" /></td>
            </tr>
          </tbody>
        </table>
      </div>

      <br>
      <br>

      <!-- 👉 Информационный блок с серым фоном -->
      <how-to-get-insurance-block>«Онкострахование»</how-to-get-insurance-block>

      <br>
      <br>

      <!-- 👉 Информационный блок с коричневым фоном -->
      <div class="information information--icon information--i">
        <h4>Информация о партнере <a href="#">«Росгосстрах»</a></h4>
        Страховая услуга: Антиклещ предоставляется страховыми компаниями —
        партнерами Банка. Не является офертой.<br>
        Для получения более подробной информации по страхованию можно получить в
        подразделениях Банка<br>(Головной офис: г. Иваново, ул. Станко. 13,
        телефон 8 (800-70) 0-92-22) и/или на сайте банка www.euroalliance.ru.<br>
        Базовая лицензия ЦБ РФ № 1781 от 18 октября 2018 г. Реклама АО КИБ
        «ЕВРОАЛЬЯНС». Реклама 0+.
      </div>
    </div>
  </section>
</template>
<script>
import HowToGetInsuranceBlock from '~/components/blocks/how-to-get-insurance-block.vue'

export default {
  components: {
    HowToGetInsuranceBlock
  },
  created () {
    // Передаем длину массива в плагин
    this.$faq.setArrayLength(1)
  }
}
</script>
