<template>
  <section class="content">
    <div class="container">
      <!--breadcrumbs-->
      <ui-breadcrumbs
        :pages="[
          { title: 'Сервисы банка', href: '/personal/servisy' },
          {
            title: 'Электронная регистрация недвижимости',
          },
        ]"
      />
      <h1>Электронная регистрация недвижимости</h1>
      <!-- 👉 page-showcase -->
      <page-showcase>
        <template #title>
          Регистрация залога — это просто!
        </template>
        <template #text>
          Сервис позволяет зарегистрировать договор залога недвижимости, договор
          на приобретение недвижимости, снятие записей о залоге без личного
          визита в Росреестр или МФЦ
        </template>
        <template #img>
          <img src="/temp/icon-slim.svg" alt="" loading="lazy">
        </template>
      </page-showcase>
      <div>
        Сервис позволяет зарегистрировать договор залога недвижимости, договор
        на приобретение недвижимости, снятие записей о залоге без личного визита
        в Росреестр или МФЦ, путем направления документов по сделке с
        оформлением электронной подписи сторон и направлением электронного
        пакета документов непосредственно в Росреестр и его территориальные
        органы.
      </div>

      <br>
      <br>
      <!-- 👉 Блок с серым фоном -->
      <div class="step-box step-box--ver back-grey">
        <div class="step-box__header">
          <div class="step-box__title center">
            Как это работает
          </div>
        </div>
        <div class="step-box__content">
          <ul>
            <li>
              <h4>Начало</h4>
              При заключении договора залога недвижимости и/или предоставлении в банк договора
              на переход права собственности по объектам недвижимости, Банк выпускает сторонам
              договора электронно-цифровую подпись и формирует электронный пакет документов для
              отправки в Росреестр по зашифрованному
              каналу связи
            </li>
            <li>
              <h4>Отправка документов</h4>
              После отправки документов, по завершении регистрации Банк получает выписку из ЕГРН,
              в которую внесена запись о залоге/переходе права собственности
            </li>
            <li>
              <h4>Успешная регистрация!</h4>
              Банк информирует клиентов об успешной регистрации сделки
            </li>
          </ul>
        </div>
      </div>

      <br>

      <!-- 👉 Информационный блок с коричневым фоном -->
      <div class="information center">
        Данная услуга оплачивается стороной сделки в соответствии с <a href="#">тарифами Банка</a>. <br>
        Услуга оказывается как физическим лицам, так юридическим лицам и ИП
      </div>
    </div>
  </section>
</template>
