<template>
  <section class="content">
    <div class="container">
      <!--breadcrumbs-->
      <ui-breadcrumbs
        :pages="[
          { title: 'Сервисы банка', href: '/personal/servisy' },
          {
            title: 'SMS-сервисы',
          },
        ]"
      />
      <h1>SMS-сервисы</h1>
      <!-- 👉 page-showcase -->
      <page-showcase>
        <template #title>
          Услуга «SMS-информирование»
        </template>
        <template #text>
          С помощью услуг «SMS-информирование» и «Активные SMS-сервисы» Вы
          всегда сможете контролировать операции по Вашей карте
        </template>
        <template #img>
          <img src="/temp/icon-slim.svg" alt="" loading="lazy">
        </template>
      </page-showcase>
      <div class="container container--small">
        <h2>Подключите услугу «SMS-информирование» к Вашей банковской карте</h2>
        <div class="list-shield">
          <ul>
            <li>
              Вы сможете контролировать операции по карте, тем самым значительно
              повысить безопасность ее использования. В течение 1 минуты с
              момента совершения операции по карте на Ваш мобильный телефон
              приходит SMS-сообщение с информацией: сумма, место, дата и время
              списания средств со счета, а также доступный остаток денежный
              средств
            </li>
            <li>
              Вы будете экономить время, не тратя его на звонок в Банк и
              ожидание информации об остатке на карте
            </li>
            <li>
              Услуга действует в любой точке мира, на которую распространяется
              зона покрытия GSM-оператора мобильной связи
            </li>
          </ul>
        </div>
      </div>

      <br>
      <br>

      <!-- 👉 Информационный блок с коричневым фоном -->
      <div class="information information--icon information--i">
        <h4>Как подключить?</h4>
        Подключиться к услуге «SMS-информирование» можно в офисах и во всех
        банкоматах Банка «ЕВРОАЛЬЯНС». Комиссия за предоставление услуги
        «SMS-информирование» взимается согласно действующим тарифам Банка.
        Комиссия за получение SMS-сообщений не взимается
      </div>
    </div>
  </section>
</template>
