<template>
  <section class="content">
    <div class="container">
      <!--breadcrumbs-->
      <ui-breadcrumbs
        :pages="[
          { title: 'Льготный период для малого и среднего бизнеса по 106-ФЗ' },
        ]"
      />
      <h1>Льготный период для малого и среднего бизнеса по 106-ФЗ</h1>
      <!-- 👉 page-showcase -->
      <page-showcase>
        <template #title>
          Поддержка МСП
        </template>
        <template #text>
          Только по кредитным договорам, заключенным до 1 марта 2022 года
        </template>
        <template #link>
          <nuxt-link to="" class="btn btn--full btn--white">
            Подать заявку
          </nuxt-link>
        </template>
        <template #img>
          <img src="/temp/icon-slim.svg" alt="" loading="lazy">
        </template>
      </page-showcase>
      <div>
        <h2>Какие компании имеют право на льготный период</h2>
        В соответствии с новыми законодательными изменениями, если деятельность
        представителя малого и среднего бизнеса относится к перечню наиболее
        пострадавших отраслей, то он может обратиться к своему кредитору (в
        банк, МФО или КПК) с заявлением о предоставлении отсрочки платежей по
        договору кредита (займа) сроком до 6 месяцев (льготный период)

        <br>
        <br>

        <p>Варианты изменения условий по действующим кредитам:</p>
        <br>
        <div class="list-shield">
          <ul>
            <li>
              отсрочка основного долга и процентов до 6 месяцев с продлением
              срока кредита — для ИП и юридических лиц;
            </li>
            <li>уменьшение регулярного платежа — только для ИП.</li>
          </ul>
        </div>
      </div>

      <br>
      <br>

      <!-- 👉 Информационная бизнес-карточка -->
      <div>
        <h3>Что может выбрать индивидуальный предприниматель?</h3>
        <business-card :reverse="true">
          <template #img>
            <img src="/temp/icon-slim.svg">
          </template>
          <template #text>
            <div>
              Индивидуальный предприниматель (ИП) может выбрать один из
              вариантов: получить право на льготный период по тем же правилам,
              что и граждане, либо, если его деятельность относится к
              определенному Правительством перечню отраслей, по правилам для
              субъектов малого и среднего предпринимательства. При этом ИП не
              сможет воспользоваться обоими вариантами кредитных каникул
              одновременно
              <br>
              <br>
              <blockquote>
                В случае продления срока кредита размер платежа будет
                аналогичным тому, который был до изменения условий. Программа
                действует до 30 сентября 2022 года
              </blockquote>
              <br>
              Заемщики, которые ранее уже обращались за льготным периодом до 30
              сентября 2022 года, также имеют право обратиться с требованием о
              предоставлении льготного периода
            </div>
          </template>
        </business-card>
      </div>

      <br>
      <br>

      <!-- 👉 Информационный блок с коричневым фоном -->
      <div class="information information--icon information--i">
        <b>Срок рассмотрения заявки не более 5 календарных дней</b> <br>
        Обращайтесь по телефону: 8 (4932) 41-78-57
      </div>

      <br>
      <br>

      <!-- 👉 Информационная бизнес-карточка -->
      <div>
        <h3>Неустойка</h3>
        <business-card>
          <template #img>
            <img src="/temp/icon-slim.svg">
          </template>
          <template #text>
            <div>
              В течение льготного периода не начисляются неустойки (штрафа,
              пени) за просрочку платежей по кредиту
              <br>
              <br>
              <blockquote>
                При этом нужно иметь в виду, что после установления льготного
                периода обязательства кредитора по предоставлению денежных
                средств заемщику приостанавливаются на весь срок действия
                льготного периода
                <br>
                <br>
                Однако заемщику будет начислена процентная ставка по кредитному
                договору за период каникул, и эта сумма должна быть выплачена
                после окончания каникул в соответствии с обновленным графиком
                платежей
              </blockquote>
              <br>
            </div>
          </template>
        </business-card>
      </div>

      <br>
      <br>
      <!-- 👉 FAQ Items -->
      <div class="faq-items">
        <faq-item
          title="Цели кредитования"
          :is-active="$faq.activeIndexes[0]"
          @click="$faq.toggleActive(0)"
        >
          Какой-то текст
        </faq-item>
        <faq-item
          title="Сумма и срок"
          :is-active="$faq.activeIndexes[1]"
          @click="$faq.toggleActive(1)"
        >
          Какой-то текст
        </faq-item>
      </div>

      <br>
      <br>

      <!-- 👉 Информационный блок с коричневым фоном -->
      <div
        class="information-showcase information-showcase--yellow-dark information-showcase--center"
      >
        <div class="information-showcase__content">
          <b>Банк осуществляет льготное кредитование субъектов малого и среднего предпринимательства</b>
        </div>
        <div class="information-showcase__aside">
          <a href="#" class="btn btn--fixed">Подробнее</a>
        </div>
      </div>
    </div>
  </section>
</template>
<script>
import BusinessCard from '~/components/cards/business-card.vue'

export default {
  components: {
    BusinessCard
  },
  created () {
    // Передаем длину массива в плагин
    this.$faq.setArrayLength(2)
  }
}
</script>
