<template>
  <section class="content">
    <div class="container">
      <!--breadcrumbs-->
      <ui-breadcrumbs
        :pages="[
          { title: 'Сервисы банка', href: '/personal/servisy' },
          {
            title: 'Ответы на актуальные вопросы',
            href: '/personal/servisy/otvety-na-aktualnye-voprosy',
          },
        ]"
      />
      <h1>Ответы на актуальные вопросы</h1>
      <!-- 👉 FAQ Items -->
      <div class="faq-items">
        <faq-item
          title="Кредитные каникулы (для граждан)"
          :is-active="$faq.activeIndexes[0]"
          @click="$faq.toggleActive(0)"
        >
          Какой-то текст
        </faq-item>
        <faq-item
          title="Меры поддержки для малого и среднего бизнеса"
          :is-active="$faq.activeIndexes[1]"
          @click="$faq.toggleActive(1)"
        >
          Какой-то текст
        </faq-item>
        <faq-item
          title="Подробнее о мерах поддержки в формате вопрос-ответ"
          :is-active="$faq.activeIndexes[2]"
          @click="$faq.toggleActive(2)"
        >
          Какой-то текст
        </faq-item>
        <faq-item
          title="Налогообложение по вкладам"
          :is-active="$faq.activeIndexes[3]"
          @click="$faq.toggleActive(3)"
        >
          <h4>
            26 марта президент подписал закон, который среди прочего отменяет
            НДФЛ с дохода по банковским вкладам и счетам, полученного в 2021 и
            2022 годах
          </h4>
          <ul>
            <li>
              <h4>Какие условия были раньше</h4>
              Кто был обязан ранее платить новый налог

              <br>
              <br>

              В 2022 году подоходный налог должны были заплатить все, кто в
              предыдущем 2021 году заработал на процентах по вкладам более
              42 500 рублей. Налог распространяется абсолютно на все категории
              граждан, в том числе на пенсионеров

              <br>
              <br>

              Вклады, оформленные до вступления в силу изменений в Налоговый
              кодекс, т. е. до 1 января 2021 года, также попадают под новый
              налог. Главное условие: процентный доход получен в 2021 году
            </li>
            <li>
              <br>
              <h4>Как рассчитывалась сумма налога</h4>
              Минимальный доход от вкладов, не попадающий под налог,
              рассчитывается исходя из ключевой ставки Центробанка,
              действующей на 1 января отчётного периода. В 2022 году эта сумма
              равна 42 500 руб. т. е. только тот доход по вкладам, что
              превышает 42 500 руб., попадает под 13% подходного налога. (В
              2023 году эта сумма будет больше, и под налог уже попадут доходы
              от вкладов, превышающие 85 000 руб.)

              <br>
              <br>

              Помните, что овердрафт — это возможность, а не
              обязанность пользоваться заемными деньгами
            </li>
            <li>
              <br>
              <h4>Пример</h4>
              Вы заработали на процентах от вклада 50 000 рублей. Этот доход
              превышает 42 500 руб., значит вы обязаны заплатить новый налог.
              Но лишь налог с той суммы, что превышает минимальный порог —
              42 500 руб. В данном случае это: 50 000 — 42 500 = 7500 руб. 13%
              подоходного налога от 7500 руб. придется заплатить в бюджет,
              т. е. сумма налога в этом случает составит 975 руб. Налог по
              вкладам в валюте рассчитывается аналогично, с тем исключением,
              что при расчете доход от вкладов переводят в рубли по курсу ЦБ
              РФ, действующему в день выплаты процентов
            </li>
          </ul>

          <br>

          <!-- 👉 Информационный блок с коричневым фоном -->
          <div class="information information--icon information--i">
            Важно: даже если у вас вклады в разных банках, то налоговая все
            равно суммирует ваш доход и рассчитает налог, исходя из вашего
            общего дохода от всех ваших вкладов
          </div>
        </faq-item>
        <faq-item
          title="Внесудебное банкротство"
          :is-active="$faq.activeIndexes[4]"
          @click="$faq.toggleActive(4)"
        >
          Какой-то текст
        </faq-item>
      </div>
    </div>
  </section>
</template>
<script>

export default {
  created () {
    // Передаем длину массива в плагин
    this.$faq.setArrayLength(5)
  }
}
</script>
