<template>
  <section class="content">
    <div class="container">
      <!--breadcrumbs-->
      <ui-breadcrumbs :pages="[{ title: 'Полезно знать' }]" />
      <h1>Полезно знать</h1>
      <!-- 👉 page-showcase-->
      <page-showcase>
        <template #title>
          Знание — сила
        </template>
        <template #text>
          «Полезно знать» — это цикл статей, в которых простыми словами
          объясняются сложные банковские понятия
        </template>
        <template #img>
          <img src="/temp/icon-slim.svg" alt="" loading="lazy">
        </template>
      </page-showcase>

      <!-- 👉 FAQ Items -->
      <div class="faq-items">
        <faq-item
          title="Овердраф"
          :is-active="$faq.activeIndexes[0]"
          @click="$faq.toggleActive(0)"
        >
          <h4>Что такое овердрафт?</h4>
          <p>
            Овердрафт – это предоставление банком держателю карты денежных
            средств под проценты на небольшой промежуток времени
          </p>
          <p>
            Термин «овердрафт» переводится с английского как «сверх
            планируемого, перерасход» и означает, что банк разрешает клиенту
            истратить не только ту сумму денег, которая есть на карточном счете,
            но и взять немного в долг («уйти в минус»), но не более, чем на
            сумму овердрафта
          </p>
          <p>
            Банк предоставляет держателю карты овердрафт, т.к. уверен, что
            в скором времени на счет клиента поступят средства, и долг будет
            погашен. Часто овердрафт предоставляется к зарплатным, пенсионным и
            другим картам, на которые регулярно зачисляются денежные средства
          </p>
          <h4>У меня всё хорошо, кредиты я не беру, зачем мне овердрафт?</h4>
          <p>
            У Вас неожиданно сломался холодильник, деньги нужны срочно, а
            зарплата только через 2 недели. В этом случае овердрафт очень
            пригодится – Вы оплачиваете покупку картой или снимаете деньги с
            карты в счет кредитного лимита и оплачиваете покупку наличными, а
            при зачислении зарплаты через 2 недели, сумма долга с процентами
            автоматически будет погашена. Идти в банк и погашать овердрафт не
            нужно.
          </p>
          <p>
            Помните, что овердрафт – это возможность, а не обязанность
            пользоваться заемными деньгами
          </p>
          <p>
            Оформляя в банке овердрафт, Вы не становитесь автоматически
            заемщиком, проценты будут начисляться только с того момента, когда
            Вы воспользуетесь овердрафтом, и будут начисляться не на всю сумму
            лимита, а только на Вашу фактическую задолженность
          </p>
        </faq-item>
        <faq-item
          title="В помощь предпринимателю — изменения 54-фз"
          :is-active="$faq.activeIndexes[1]"
          @click="$faq.toggleActive(1)"
        >
          <div class="information">
            Чтобы разобраться во всех тонкостях изменений законодательства
            федеральная налоговая служба предоставила подробную и понятную
            презентацию для предпринимателей — <a href="#">смотрите здесь</a>
          </div>
        </faq-item>
        <faq-item
          title="В помощь предпринимателю — о новом механизме поддержки промышленных предприятий"
          :is-active="$faq.activeIndexes[2]"
          @click="$faq.toggleActive(2)"
        >
          <h4>
            Департамент экономического развития и торговли информирует о новом
            механизме поддержки промышленных предприятий. Среди изменений
            можно выделить
          </h4>
          <div class="list-dotted">
            <ul>
              <li>увеличение общей стоимости проекта до 7,5 млрд.руб</li>
              <li>
                продление периода получения банковских кредитов до 2019 года
              </li>
              <li>
                включение в механизм поддержки субсидирование по облигациям ,
                выпущеннным в 2017 —2019 годах в рамках реализации
                инвестиционных проектов в сфере промышленности
              </li>
            </ul>
          </div>
          <br>
          <div class="information">
            Подробности отражены в презентации — <a href="#">смотрите здесь</a>
          </div>
        </faq-item>
      </div>
    </div>
  </section>
</template>
<script>

export default {
  created () {
    // Передаем длину массива в плагин
    this.$faq.setArrayLength(3)
  }
}
</script>
