<template>
  <section class="content">
    <div class="container">
      <!--breadcrumbs-->
      <ui-breadcrumbs
        :pages="[
          { title: 'Раскрытие информации', href: '/raskrytie-informacii' },
          { title: 'Финансовая отчётность' },
        ]"
      />
      <h1>Финансовая отчётность</h1>
      <!-- 👉 FAQ Items -->
      <div class="faq-items">
        <faq-item
          title="2023 год"
          :is-active="$faq.activeIndexes[0]"
          @click="$faq.toggleActive(0)"
        >
          <table class="document-table">
            <tbody>
              <tr>
                <td>
                  Промежуточная бухгалтерская
                  (финансовая) отчётность
                  на 1 октября 2023 года
                  <small>Дата размещения 15.12.2023</small>
                </td>
                <td>
                  <div class="list-normal">
                    <ul>
                      <li>
                        <a href="#">Бухгалтерский баланс на 1 октября 2023 г</a>
                      </li>
                      <li>
                        <a href="#">Сведения об обязательных нормативах, нормативе финансового рычага и нормативе
                          краткосрочной ликвидности на 1 октября 2023 г </a>
                      </li>
                      <li>
                        <a href="#">Отчет о финансовых результатах на 1 октября 2023 г</a>
                      </li>
                      <li>
                        <a href="#">Отчет об изменениях в капитале кредитной организации на 1 октября 2023 г</a>
                      </li>
                      <li>
                        <a href="#">Сведения об обязательных нормативах, нормативе финансового рычага и нормативе
                          краткосрочной ликвидности на 1 октября 2023 г. </a>
                      </li>
                      <li>
                        <a href="#">Примечание к промежуточной бухгалтерской (финансовой) отчетности на 1 октября 2023 г</a>
                      </li>
                    </ul>
                  </div>
                </td>
              </tr>
              <tr>
                <td>
                  Промежуточная бухгалтерская
                  (финансовая) отчётность
                  на 1 октября 2023 года
                  <small>Дата размещения 15.12.2023</small>
                </td>
                <td>
                  <div class="list-normal">
                    <ul>
                      <li>
                        <a href="#">Бухгалтерский баланс на 1 октября 2023 г</a>
                      </li>
                      <li>
                        <a href="#">Сведения об обязательных нормативах, нормативе финансового рычага и нормативе
                          краткосрочной ликвидности на 1 октября 2023 г </a>
                      </li>
                      <li>
                        <a href="#">Отчет о финансовых результатах на 1 октября 2023 г</a>
                      </li>
                      <li>
                        <a href="#">Отчет об изменениях в капитале кредитной организации на 1 октября 2023 г</a>
                      </li>
                      <li>
                        <a href="#">Сведения об обязательных нормативах, нормативе финансового рычага и нормативе
                          краткосрочной ликвидности на 1 октября 2023 г. </a>
                      </li>
                      <li>
                        <a href="#">Примечание к промежуточной бухгалтерской (финансовой) отчетности на 1 октября 2023 г</a>
                      </li>
                    </ul>
                  </div>
                </td>
              </tr>
              <tr>
                <td>
                  Промежуточная бухгалтерская
                  (финансовая) отчётность
                  на 1 октября 2023 года
                  <small>Дата размещения 15.12.2023</small>
                </td>
                <td>
                  <div class="list-normal">
                    <ul>
                      <li>
                        <a href="#">Бухгалтерский баланс на 1 октября 2023 г</a>
                      </li>
                      <li>
                        <a href="#">Сведения об обязательных нормативах, нормативе финансового рычага и нормативе
                          краткосрочной ликвидности на 1 октября 2023 г </a>
                      </li>
                      <li>
                        <a href="#">Отчет о финансовых результатах на 1 октября 2023 г</a>
                      </li>
                      <li>
                        <a href="#">Отчет об изменениях в капитале кредитной организации на 1 октября 2023 г</a>
                      </li>
                      <li>
                        <a href="#">Сведения об обязательных нормативах, нормативе финансового рычага и нормативе
                          краткосрочной ликвидности на 1 октября 2023 г. </a>
                      </li>
                      <li>
                        <a href="#">Примечание к промежуточной бухгалтерской (финансовой) отчетности на 1 октября 2023 г</a>
                      </li>
                    </ul>
                  </div>
                </td>
              </tr>
            </tbody>
          </table>
        </faq-item>
        <faq-item
          title="2022 год"
          :is-active="$faq.activeIndexes[1]"
          @click="$faq.toggleActive(1)"
        >
          Какой-то текст
        </faq-item>
        <faq-item
          title="2021 год"
          :is-active="$faq.activeIndexes[2]"
          @click="$faq.toggleActive(2)"
        >
          Какой-то текст
        </faq-item>
      </div>
    </div>
  </section>
</template>
<script>

export default {
  created () {
    // Передаем длину массива в плагин
    this.$faq.setArrayLength(3)
  }
}
</script>
