<template>
  <section class="content">
    <div class="container">
      <!--breadcrumbs-->
      <ui-breadcrumbs
        :pages="[
          { title: 'Раскрытие информации', href: '/raskrytie-informacii' },
          { title: 'О налогообложении иностранных счетов (FATCA)' },
        ]"
      />
      <h1>О налогообложении иностранных счетов (FATCA)</h1>
      <h2>О налогообложении иностранных счетов (FATCA)</h2>
      <p>
        В связи с вступлением в силу с 1 июля 2014 года Закона США «О
        налогообложении иностранных счетов» (далее — FATCA) АО КИБ «ЕВРОАЛЬЯНС»
        (далее — Банк) осуществил регистрацию в Налоговом управлении США
        (Internal Revenue Service (IRS)) в статусе финансового института,
        соблюдающего требования FATCA (Participating Financial Institution not
        covered by an IGA). Банку был присвоен индивидуальный идентификационный
        номер: <b>T2NMYL.99999.SL.643</b>
      </p>

      <br>

      <blockquote>
        29 июня 2017 года Банк продлил соглашение с IRS с сохранением ранее
        присвоенного статуса финансового института и индивидуального
        идентификационного номера
      </blockquote>

      <br>

      <p>
        В соответствии с пп. 3 ст. 2 Федерального закона от 28.06.2014 N 173-ФЗ
        «Об особенностях осуществления финансовых операций с иностранными
        гражданами и юридическими лицами, о внесении изменений в Кодекс
        Российской Федерации об административных правонарушениях и признании
        утратившими силу отдельных положений законодательных актов Российской
        Федерации» в Банке были утверждены следующие документы:
      </p>

      <br>

      <div class="list-normal">
        <ul>
          <li>
            <a href="#">Положение об особенностях осуществления финансовых операций с иностранными гражданами и
              юридическими лицами в АО КИБ «ЕВРОАЛЬЯНС»</a>
          </li>
          <li><a href="#">Налоговый сертификат</a></li>
        </ul>
      </div>
    </div>
  </section>
</template>
