<template>
  <section class="content">
    <div class="container">
      <!--breadcrumbs-->
      <ui-breadcrumbs
        :pages="[
          { title: 'Помощь бизнесу', href: '/biznesu/pomoshch-biznesu' },
          { title: 'Банк заблокировал счет. Что делать?' },
        ]"
      />
      <h1>Банк заблокировал счет. Что делать?</h1>

      <!-- 👉 page-showcase -->
      <page-showcase>
        <template #title>
          Что делать?
        </template>
        <template #text>
          Блокировка счета, когда клиенты полностью теряют доступ к своим
          деньгам — это крайняя мера
        </template>
        <template #img>
          <img src="/temp/icon-slim.svg" alt="" loading="lazy">
        </template>
      </page-showcase>
      <div>
        Банки используют ее только в отношении террористов и экстремистов. Но
        предприниматели могут оказаться в более распространенной ситуации, когда
        банк останавливает все платежи за исключением обязательных — например,
        погашения налогов
        <br>
        <br>
        Как только долг, из-за которого заблокировали переводы, будет закрыт,
        вам снова станут доступны любые транзакции. Также банк может ограничить
        дистанционное банковское обслуживание (ДБО). При этом сам счет
        продолжает работать и клиент может распоряжаться своими деньгами.
        Правда, сделать платеж или перевод получится только в офисе банка.
      </div>
    </div>
  </section>
</template>
