<template>
  <section class="content">
    <div class="container">
      <!--breadcrumbs-->
      <ui-breadcrumbs
        :pages="[
          { title: 'Помощь бизнесу', href: '/biznesu/pomoshch-biznesu' },
          { title: 'Эквайринг - плюсы и минусы' },
        ]"
      />
      <h1>Эквайринг - плюсы и минусы</h1>

      <!-- 👉 page-showcase -->
      <page-showcase>
        <template #title>
          Оплата банковской картой прочно вошла в нашу жизнь
        </template>
        <template #text>
          За последние пару лет Россия как в Европе, так и в мире прочно заняла
          лидерские позиции по количеству безналичных платежей
        </template>
        <template #img>
          <img src="/temp/icon-slim.svg" alt="" loading="lazy">
        </template>
      </page-showcase>
      <h2>
        По поручению клиента на основании расчётных документов банк
        осуществляет действия по получению платежа от плательщика
      </h2>
      За последние пару лет Россия как в Европе, так и в мире прочно заняла
      лидерские позиции по количеству безналичных платежей. Подавляющее
      большинство опрошенных россиян утверждают, что хорошо освоили и
      ежедневно пользуются банковской картой или оплачивают покупки с помощью
      смартфона
      <br>
      <br>
      Но до сих пор встречаются розничные точки, где расплатиться можно только
      наличными либо переводом на карту физлица, потому что владельцы экономят
      на эквайринге. Эквайринг как безналичный способ расчета с покупателем –
      это в данном случае предоставление и обслуживание pos-терминала для
      оплаты за товары или услуги

      <br>
      <br>

      <!-- 👉 Информационная бизнес-карточка -->
      <h3>Плюсы и минусы эквайринга</h3>
      <business-card :reverse="true">
        <template #img>
          <img src="/temp/icon-slim.svg">
        </template>
        <template #text>
          <div class="list-shield">
            <ul>
              <li>
                Рост продаж, т.к. все больше людей предпочитают расплачиваться
                исключительно картой (или с помощью смартфона)
              </li>
              <li>
                покупателям легче решиться на покупку, в том числе дорогую,
                поскольку психологически с деньгами на карте расставаться
                легче
              </li>
              <li>
                вы защищены от грабежа, т.к. денежные средства надежно
                хранятся на банковском счете, а не в ящике стола продавца
              </li>
              <li>
                вы защищены от фальшивых купюр и вам не нужно заботиться о
                наличии денег под сдачу
              </li>
              <li>
                вашу карту не заблокируют и вам не придется давать
                разъяснения, почему у вас так много переводов на личную карту,
                если вы используйте её для приема оплаты для покупателей
              </li>
              <li>
                эквайринг дает возможность вашему бизнесу получить льготные
                условия кредитования и обслуживания от банка, предоставляющего
                pos-терминал
              </li>
              <br>
              <br>
            </ul>
          </div>
          <div class="list-cancel">
            <ul>
              <li>комиссия и/или плата за аренду терминала</li>
              <li>
                плата за эквайринг иногда вынуждает немного повысить цены
              </li>
            </ul>
          </div>
        </template>
      </business-card>

      <br>
      <br>
      Но все же данные затраты являются незначительными и перекрываются с
      ростом доходов предприятия. Потому что, при подключении эквайринга
      предприниматели, как правило, сразу же увеличивают свой доход минимум на
      15%
    </div>
  </section>
</template>
<script lang="ts">
import BusinessCard from '~/components/cards/business-card.vue'

export default {
  components: {
    BusinessCard
  }
}
</script>
