<template>
  <section class="content">
    <div class="container">
      <!--breadcrumbs-->
      <ui-breadcrumbs
        :pages="[
          { title: 'Помощь бизнесу', href: '/biznesu/pomoshch-biznesu' },
          { title: 'Список компаний с признаками нелегальной деятельности' },
        ]"
      />
      <h1>Список компаний с признаками нелегальной деятельности</h1>

      <!-- 👉 page-showcase -->
      <page-showcase>
        <template #title>
          Мониторинг
        </template>
        <template #text>
          Банк России с помощью специальной системы мониторинга, а также
          по обращениям граждан и организаций выявляет (в том числе в Интернете)
          компании и проекты с признаками нелегальной деятельности
        </template>
        <template #img>
          <img src="/temp/icon-slim.svg" alt="" loading="lazy">
        </template>
      </page-showcase>
      <div>
        В список включено более 1,8 тыс. организаций и интернет-проектов, в
        деятельности которых Банк России выявил признаки финансовой пирамиды,
        нелегального кредитора или профессионального участника рынка ценных
        бумаг. Ознакомиться с перечнем можно здесь
      </div>
      <br>
      <br>
      <div class="information information--icon information--i">
        Публикация такого перечня направлена на защиту интересов потребителей и
        позволит своевременно предупреждать их рисках, связанных с подобными
        компаниями
      </div>
    </div>
  </section>
</template>
