<template>
  <section class="content">
    <div class="container">
      <!-- 🤟 Хлебные крошки-->
      <ui-breadcrumbs
        :pages="[
          { title: 'Денежные переводы', href: '/personal/denezhnye-perevody' },
          {
            title: 'Перевод средств с карты на карту',
            href: '/personal/denezhnye-perevody/perevod-sredstv-s-karty-na-kartu',
          },
        ]"
      />

      <h1>Перевод средств с карты на карту</h1>

      <div class="payment-frame">
        <iframe src="" style="background-color: #f2f2f2" />
      </div>

      <div class="offset-top offset--small">
        <!-- 👉 FAQ Items -->
        <div class="faq-items">
          <faq-item
            title="Комиссия и лимиты"
            :is-active="$faq.activeIndexes[0]"
            @click="$faq.toggleActive(0)"
          >
            <h3>Ограничения на сумму перевода</h3>
            <div class="list-dotted">
              <ul>
                <li>
                  <h4>Максимальная сумма одного перевода Клиента</h4>
                  Максимальная сумма одного перевода Клиента, совершенного по
                  Карте составляет 150 000 (сто пятьдесят тысяч) рублей РФ или
                  их эквивалент в долларах США/евро, с учетом Комиссии
                </li>
                <li>
                  <h4>Максимальная сумма всех переводов Клиента</h4>
                  Максимальная сумма всех переводов Клиента, совершенных в
                  течение календарного месяца по одной Карте получателя или
                  одной Карте отправителя при оказании Услуги составляет 600
                  000 (шестьсот тысяч) рублей РФ или их эквивалент в долларах
                  США/евро, с учетом Комиссии
                </li>
              </ul>
            </div>

            <br>
            <br>

            <ul class="payment-limit">
              <li>
                <div class="payment-limit__value">
                  1,5%
                </div>
                <div class="payment-limit__info">
                  минимум 50 ₽
                </div>
                <div class="payment-limit__text">
                  С карты Банка «ЕВРОАЛЬЯНС» на карты других банков
                </div>
              </li>
              <li>
                <div class="payment-limit__value">
                  1%
                </div>
                <div class="payment-limit__info">
                  минимум 50 ₽
                </div>
                <div class="payment-limit__text">
                  С карт других банков на карту Банка "ЕВРОАЛЬЯНС"
                </div>
              </li>
              <li>
                <div class="payment-limit__value">
                  1,5%
                </div>
                <div class="payment-limit__info">
                  минимум 50 ₽
                </div>
                <div class="payment-limit__text">
                  Переводы между картами других банков
                </div>
              </li>
              <li>
                <div class="payment-limit__value">
                  1%
                </div>
                <div class="payment-limit__info">
                  минимум 50 ₽
                </div>
                <div class="payment-limit__text">
                  С карты Банка «ЕВРОАЛЬЯНС» на карту Банка «ЕВРОАЛЬЯНС»
                </div>
              </li>
              <li>
                <div class="payment-limit__value">
                  0 ₽
                </div>
                <div class="payment-limit__info">
                  до 100 000 ₽
                </div>
                <div class="payment-limit__text">
                  С карты Банка «ЕВРОАЛЬЯНС» на карту Банка «ЕВРОАЛЬЯНС»
                </div>
              </li>
            </ul>

            <br>
            <br>

            <h3>Ограничения на виды Карт</h3>
            <div class="list-dotted">
              <ul>
                <li>
                  Карты, выпущенные Банком к расчетному счету юридического
                  лица;
                </li>
                <li>
                  Иные виды карт, запрет или ограничение на проведение
                  операций, по которым установлены Банком – эмитентом и/или
                  Платежной системой и/или законодательством РФ.
                </li>
                <li>
                  Карты, выпущенные к виртуальным кошелькам в системе Qiwi
                  Visa Wallet (БИН 489049)
                </li>
              </ul>
            </div>

            <br>
            <br>

            <!-- 👉 Информационный блок с коричневым фоном -->
            <div class="information information--icon information--0">
              Переводы с карты Банка «ЕВРОАЛЬЯНС» на карту Банка «ЕВРОАЛЬЯНС»
              через
              <nuxt-link to="/personal/servisy/ibank">
                интернет-банк для физических лиц
              </nuxt-link>
              iBank
              осуществляется без комиссии
            </div>
          </faq-item>
          <faq-item
            title="Как совершить перевод"
            :is-active="$faq.activeIndexes[1]"
            @click="$faq.toggleActive(1)"
          >
            <div class="list-number">
              <ul>
                <li>
                  <h4>Введите данные карт</h4>
                  Для отправителя обязательно имя и фамилию, срок действия и
                  код безопасности CVC2/CVV2. Также введите e-mail адрес, на
                  который хотите получить чек
                </li>
                <li>
                  <h4>Проверьте введенные данные</h4>
                  Проверьте введенные данные и нажмите «ПЕРЕВЕСТИ». Нажимая
                  кнопку «Перевести»,вы принимаете Условия, Политику в
                  отношении обработки персональных данных
                </li>
                <li>
                  <h4>Получите электронный чек</h4>
                  Получите электронный чек на указанный e-mail адрес
                </li>
              </ul>
            </div>
            <br>
            <!-- 👉 Информационный блок с коричневым фоном -->
            <div class="information">
              <h4>Срок исполнения Банком Распоряжения Клиента</h4>
              <p>
                Срок исполнения Банком Распоряжения Клиента, а именно:
                зачисление средств на Счет Карты получателя зависит от
                Банка-эмитента Карты получателя, и может составлять от
                нескольких минут до нескольких дней
              </p>
              <p>
                Банк не несет ответственность за ошибки, допущенные Клиентом
                при формировании Распоряжения, приведшие к переводу
                некорректной Суммы, в некорректной Валюте перевода или по
                некорректным реквизитам
              </p>
              <p>
                В указанных случаях Услуга считается оказанной Банком Клиенту
                надлежащим образом и в полном соответствии с Договором, и
                Клиент самостоятельно урегулирует дальнейшие в заиморасчеты с
                физическим лицом, на Счет которого поступили денежные средства
                в результате оказания Услуги
              </p>
            </div>
          </faq-item>
        </div>
      </div>
    </div>
  </section>
</template>
<script>

export default {
  created () {
    // Передаем длину массива в плагин
    this.$faq.setArrayLength(2)
  }
}
</script>
