const BankCardData = [
  {
    type: 'credit',
    title: 'Кредитная карта — 50 дней без процентов',
    description:
      'Оформите «Кредитную» карту в Банке «ЕВРОАЛЬЯНС» и получите преимущества:',
    img: '/temp/card.jpg',
    icon: '/temp/card.jpg',
    link: '/personal/karty/bez-procentov',
    items: [
      '50 дней без процентов',
      'Индивидуальный лимит',
      'Отсутствует обязательный ежемесячный платеж'
    ]
  },
  {
    type: 'debet',
    title: 'Дебетовая карта',
    description:
      'Оформите бесплатно в Банке «ЕВРОАЛЬЯНС» получите:',
    img: '/temp/bank-card2.png',
    icon: '/temp/card.jpg',
    link: '/personal/karty/debetovaya',
    items: [
      'Кешбек до 30%',
      'Бесплатное снятие наличных в любом банкомате',
      'Кредит с льготным периодом'
    ]
  },
  {
    type: 'salary',
    title: 'Зарплатная карта',
    description:
      'Откройте индивидуальную зарплатную карту и пользуйтесь всеми привилегиями зарплатных клиентов:',
    img: '/temp/bank-card2.png',
    icon: '/temp/card.jpg',
    link: '/personal/karty/zarplatnaya',
    items: [
      'бесплатный выпуск и обслуживание дебетовой карты',
      'до 5 операций в месяц снятие в любых банкоматах – без комиссии',
      'sms-информирование – 35 руб. в месяц (подключается при желании)',
      'кредитование по ставкам для зарплатных клиентов (20% с обеспечением, 23% без обеспечения - программа «Для своих»)',
      'кеш-бэк от платежной системы Мир',
      'интернет-банк и мобильный банк бесплатно'
    ]
  },
  {
    type: 'pension',
    title: 'Пенсионная карта',
    description:
      'Преимущества Пенсионной карты Банка «ЕВРОАЛЬЯНС»:',
    img: '/temp/bank-card3.png',
    icon: '/temp/card.jpg',
    link: '/personal/karty/pensionnaya',
    items: [
      'бесплатный выпуск карты Мир',
      'на остаток денежных средств на Вашем карточном счете начисляются проценты в размере 4% годовых',
      'снятие наличных денежных средств в любом банкомате и пунктах выдачи наличных АО КИБ «ЕВРОАЛЬЯНС» без комиссий',
      'SMS-информирование на Ваш мобильный телефон обо всех операциях по карте'
    ]
  }
]

export default BankCardData
