<template>
  <section class="content">
    <div class="container">
      <!--breadcrumbs-->
      <ui-breadcrumbs
        :pages="[
          { title: 'Банк-клиент', href: '/biznesu/bank-klient' },
          { title: 'Центр финансового контроля' },
        ]"
      />
      <h1>Центр финансового контроля</h1>
      <!-- 👉 page-showcase -->
      <page-showcase>
        <template #title>
          Юридическим лицам и индивидуальным предпринимателям
        </template>
        <template #text>
          РБанк «ЕВРОАЛЬЯНС» предлагает воспользоваться преимуществами сервиса
          ЦЕНТР ФИНАНСОВОГО КОНТРОЛЯ системы дистанционного обслуживания
          клиентов «Банк-Клиент»
        </template>
        <template #img>
          <img src="/temp/icon-slim.svg" alt="" loading="lazy">
        </template>
      </page-showcase>
      <div class="container container--small">
        <h2>Основные возможности сервиса</h2>
        <div class="list-shield">
          <ul>
            <li>
              Одновременная работа пользователя с документами нескольких
              организаций;
            </li>
            <li>
              Одновременная работа пользователя со справочниками нескольких
              организаций;
            </li>
            <li>
              Возможность выборочной подписи (визирования) документов нескольких
              организаций;
            </li>
            <li>
              Получение консолидированной отчётности по счетам нескольких
              организаций;
            </li>
            <li>
              Отсутствие необходимости в «переключении» между организациями и в
              смене дискет с ключами&nbsp;ЭЦП. Для визирования документов
              контролируемой организации пользователь должен иметь ключ&nbsp;ЭЦП
              данной организации с соответствующей группой подписи.
            </li>
          </ul>
        </div>
      </div>

      <br>
      <br>

      <!-- 👉 Информационный блок с серым фоном -->
      <div class="information information--grey information--back">
        <div class="container container--small">
          <h3>Управление счетами нескольких организаций одним исполнителем</h3>
          <b>Исполнитель через клиентский АРМ «Центр финансового контроля»</b><br>
          работает со счетами и документами всех подчинённых (дочерних)
          организаций. Исполнитель от имени подчинённых организаций создаёт и
          подписывает платёжные документы самостоятельно, используя секретные
          ключи ЭЦП подчинённых организаций, а также ведёт мониторинг состояния
          их счетов (просмотр выписок и остатков по счетам)
          <br>
          <br>
          Та же схема может применяться для группы организаций, которые
          обслуживаются одной (централизованной) бухгалтерией - одним или
          нескольками пользователями, которые централизовано управляют счетами
          нескольких организаций с помощью системы Банк-Клиент
          <br>
          <br>
          Все пользователи клиентского АРМа "Центр финансового контроля"
          работают в едином пространстве счетов, документов и счетов подчинённых
          организаций. Поддерживается одновременная работа нескольких
          пользователей бухгалтерии
        </div>
      </div>

      <br>
      <br>

      <!-- 👉 Информационная бизнес-карточка -->
      <div>
        <h3>
          Управление счетами территориально удалённых филиалов и дочерних
          организаций
        </h3>
        <business-card :reverse="true">
          <template #img>
            <img src="/temp/icon-slim.svg">
          </template>
          <template #text>
            <div>
              Ценрализованная бухгалтерия головной организации с помощью
              клиентского АРМа «Центр финансового контроля» работает в едином
              пространстве счетов, документов и отчётов филиалов и дочерних
              организаций, визирует их документы соответствующими ключами
              <br>
              <br>
              <p>
                Филиалы и дочерние организации управляют своими счетами с
                помощью системы «Банк-Клиент», создают и подписывают платёжные
                документы, получают из банка выписки
              </p>
              <br>
              При этом головная организация ведёт мониторинг и осуществляет
              управление счетами филиалов и дочерних организаций с помощью
              клиентского АРМа «Центр финансового контроля» или же головная
              организация обладает правом подписи для принятия к исполнению
              банком документов дочерних организаций
            </div>
          </template>
        </business-card>
      </div>

      <br>
      <br>

      <div class="info-box">
        <h3>
          Для использования данного сервиса в Вашей организации, Вам необходимо
        </h3>
        <div class="list-number">
          <ul>
            <li>
              <h4>Подключение</h4>
              Подключить все организации к системе «Банк-Клиент»
            </li>
            <li>
              <h4>Генерация ключа</h4>
              Сгенерировать ключ для доступа к «Центру финансового контроля»
            </li>
            <li>
              <h4>Заявление</h4>
              Написать заявление на подключение к сервису «Центр финансового
              контроля»
            </li>
            <li>
              <h4>Сертификат</h4>
              Представить сертификат ключа в банк
            </li>
          </ul>
        </div>
      </div>

      <br>
      <br>

      <!-- 👉 Документы -->
      <div>
        <h3>Информация и документы</h3>
        <div class="columns columns--cards">
          <div class="column col-6">
            <document-card>
              <template #title>
                <a href="#">Договор банковского счета в валюте</a>
              </template>
              <template #size>
                77 kB
              </template>
            </document-card>
          </div>
          <div class="column col-6">
            <document-card>
              <template #title>
                <a href="#">Состав представляемой информации по валютным операциям</a>
              </template>
              <template #size>
                77 kB
              </template>
            </document-card>
          </div>
          <div class="column col-6">
            <document-card>
              <template #title>
                <a href="#">Договор банковского счета в валюте</a>
              </template>
              <template #size>
                77 kB
              </template>
            </document-card>
          </div>
        </div>
      </div>
    </div>
  </section>
</template>
<script lang="ts">
import BusinessCard from '~/components/cards/business-card.vue'

export default {
  components: {
    BusinessCard
  }
}
</script>
